id: 303e7728-b654-467c-a509-00211879716c
name: Azure VM Run Command or Custom Script execution detected
description: |
  'A user has either initiated a Azure VM Run Command or Custom Script execution.'
severity: Medium
requiredDataConnectors:
- connectorId: AzureActivity
  dataTypes:
  - AzureActivity
queryFrequency: PT30M
queryPeriod: PT35M
triggerOperator: gt
triggerThreshold: 0
enabled: true
tactics:
- Execution
- LateralMovement
relevantTechniques:
- T1059
- T1059.001
- T1059.002
- T1072
query: |
  AzureActivity
  | where CategoryValue == "Administrative"
  | where OperationNameValue =~ "Microsoft.Compute/virtualMachines/runCommand/action"
  | extend VMName = tostring(todynamic(Properties).resource)
  | summarize make_list(ActivityStatusValue), TimeGenerated = max(TimeGenerated) by CorrelationId, CallerIpAddress, Caller, ResourceGroup, VMName
entityMappings:
- entityType: Account
  fieldMappings:
  - identifier: AadUserId
    columnName: Caller
- entityType: Host
  fieldMappings:
  - identifier: HostName
    columnName: VMName
eventGroupingSettings:
  aggregationKind: AlertPerResult
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: PT5H
    matchingMethod: AllEntities
    groupByEntities: []
    groupByAlertDetails: []
    groupByCustomDetails: []
version: 1.0.0
kind: Scheduled
tags:
- Sentinel-As-Code
- Custom
- Azure Activity
