id: 70fc7201-f28e-4ba7-b9ea-c04b96701f13
name: User added to Microsoft Entra ID Privileged Groups
description: |
  Identifies when a user is added to any of the Privileged Groups such as
  Global Admins, Privileged Role Admins, or User Account Admins. This may
  indicate persistence or privilege escalation activity.
severity: Medium
requiredDataConnectors:
- connectorId: AzureActiveDirectory
  dataTypes:
  - AuditLogs
enabled: true
tactics:
- Persistence
- PrivilegeEscalation
relevantTechniques:
- T1078
- T1078.004
- T1098
- T1098.003
query: |
  let OperationList = dynamic(["Add member to role", "Add eligible member to role"]);
  let PrivilegedGroups = dynamic(["UserAccountAdmins", "PrivilegedRoleAdmins", "TenantAdmins", "PrivilegedAuthenticationAdmins"]);
  AuditLogs
  | where Category =~ "RoleManagement"
  | where OperationName in~ (OperationList)
  | mv-apply TargetResource = TargetResources on
    (
      where TargetResource.type =~ "User"
      | extend TargetUserPrincipalName = tostring(TargetResource.userPrincipalName),
               modProps = TargetResource.modifiedProperties
    )
  | mv-apply Property = modProps on
    (
      where Property.displayName =~ "Role.WellKnownObjectName"
      | extend DisplayName = trim('"', tostring(Property.displayName)),
               GroupName = trim('"', tostring(Property.newValue))
    )
  | extend InitiatingAppId = tostring(InitiatedBy.app.appId)
  | extend InitiatingAppName = tostring(InitiatedBy.app.displayName)
  | extend InitiatingAppServicePrincipalId = tostring(InitiatedBy.app.servicePrincipalId)
  | extend InitiatingAppServicePrincipalName = tostring(InitiatedBy.app.servicePrincipalName)
  | extend InitiatingUserPrincipalName = tostring(InitiatedBy.user.userPrincipalName)
  | extend InitiatingAadUserId = tostring(InitiatedBy.user.id)
  | extend InitiatingIpAddress = tostring(iff(isnotempty(InitiatedBy.user.ipAddress), InitiatedBy.user.ipAddress, InitiatedBy.app.ipAddress))
  | extend InitiatingUserRoles = InitiatedBy.user.roles
  | where GroupName in~ (PrivilegedGroups)
  | project TimeGenerated, AADOperationType, Category, OperationName, AADTenantId, InitiatingUserPrincipalName, InitiatingAadUserId, InitiatingAppName, InitiatingAppId, InitiatingAppServicePrincipalId, InitiatingIpAddress, InitiatingUserRoles, DisplayName, GroupName, TargetUserPrincipalName
  | extend InitiatedByName = tostring(split(InitiatingUserPrincipalName, '@', 0)[0]), InitiatedByUPNSuffix = tostring(split(InitiatingUserPrincipalName, '@', 1)[0])
  | extend TargetName = tostring(split(TargetUserPrincipalName, '@', 0)[0]), TargetUPNSuffix = tostring(split(TargetUserPrincipalName, '@', 1)[0])
entityMappings:
- entityType: Account
  fieldMappings:
  - identifier: FullName
    columnName: InitiatingUserPrincipalName
  - identifier: Name
    columnName: InitiatedByName
  - identifier: UPNSuffix
    columnName: InitiatedByUPNSuffix
- entityType: Account
  fieldMappings:
  - identifier: FullName
    columnName: TargetUserPrincipalName
  - identifier: Name
    columnName: TargetName
  - identifier: UPNSuffix
    columnName: TargetUPNSuffix
- entityType: Account
  fieldMappings:
  - identifier: AadUserId
    columnName: InitiatingAadUserId
- entityType: Account
  fieldMappings:
  - identifier: AadUserId
    columnName: InitiatingAppServicePrincipalId
- entityType: IP
  fieldMappings:
  - identifier: Address
    columnName: InitiatingIpAddress
version: 1.0.7
kind: NRT
tags:
- Sentinel-As-Code
- Custom
- Privilege Escalation
