id: 54b355e7-1736-425e-8627-4972161b135a
name: AzureHound activity detected
description: |
  'Microsoft Graph queries sent to the tenant contained the User Agent string of AzureHound. This is a high fedility indicator that someone scans your Azure AD tenant for additional information and might be part of the inital phase of an attack.'
severity: Medium
enabled: true
tactics:
- Reconnaissance
- Discovery
relevantTechniques:
- T1069
- T1069.003
- T1087
- T1087.004
- T1589
- T1595
- T1595.002
query: |
  MicrosoftGraphActivityLogs
  | where UserAgent has "azurehound"
  | summarize QueriesSent=count() by UserId, IPAddress, ServicePrincipalId, AppId, TokenIssuedAt, Location, SignInActivityId, SourceSystem, AadTenantId, UserAgent
  | extend ConfidenceScore = 1
  | extend RemediationSteps = "Identify the identity and device used for this activity and confirm this is not a security test. If you can rule out a security test initiate the  incident response process to decide if the attacker can be evicted or should be observed"
entityMappings:
- entityType: Account
  fieldMappings:
  - identifier: AadUserId
    columnName: UserId
- entityType: IP
  fieldMappings:
  - identifier: Address
    columnName: IPAddress
alertDetailsOverride:
  alertDynamicProperties:
  - alertProperty: RemediationSteps
    value: RemediationSteps
  - alertProperty: ConfidenceScore
    value: ConfidenceScore
eventGroupingSettings:
  aggregationKind: SingleAlert
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: true
    reopenClosedIncident: false
    lookbackDuration: PT5H
    matchingMethod: Selected
    groupByEntities:
    - Account
    groupByAlertDetails: []
    groupByCustomDetails: []
version: 1.0.0
kind: NRT
tags:
- Sentinel-As-Code
- Custom
- Microsoft Graph
