id: 35c94c09-afd3-4141-b5f6-4cbb67e00998
name: Brute force attack against Azure Portal
description: |
  Identifies evidence of brute force activity against Azure Portal by highlighting multiple authentication failures
  and by a successful authentication within a given time window.
  (The query does not enforce any sequence - eg requiring the successful authentication to occur last.)
  Default Failure count is 5, Default Success count is 1 and default Time Window is 20 minutes.
  References: https://docs.microsoft.com/en-us/azure/active-directory/reports-monitoring/reference-sign-ins-error-codes.
severity: Medium
requiredDataConnectors:
- connectorId: AzureActiveDirectory
  dataTypes:
  - SigninLogs
queryFrequency: P1D
queryPeriod: P1D
triggerOperator: gt
triggerThreshold: 0
enabled: true
tactics:
- CredentialAccess
- InitialAccess
relevantTechniques:
- T1078
- T1078.004
- T1110
- T1110.001
- T1110.003
query: |
  let failureCountThreshold = 5;
  let successCountThreshold = 1;
  let timeRange = 1d;
  let authenticationWindow = 20m;
  SigninLogs
  | where TimeGenerated >= ago(timeRange)
  | extend OS = DeviceDetail.operatingSystem, Browser = DeviceDetail.browser
  | extend StatusCode = tostring(Status.errorCode), StatusDetails = tostring(Status.additionalDetails)
  | extend State = tostring(LocationDetails.state), City = tostring(LocationDetails.city)
  | where AppDisplayName contains "Azure Portal"
  // Split out failure versus non-failure types
  | extend FailureOrSuccess = iff(ResultType in ("0", "50125", "50140"), "Success", "Failure")
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), IPAddress = makeset(IPAddress), makeset(OS), makeset(Browser), makeset(City),
  makeset(ResultType), FailureCount = countif(FailureOrSuccess=="Failure"), SuccessCount = countif(FailureOrSuccess=="Success")
  by bin(TimeGenerated, authenticationWindow), UserDisplayName, UserPrincipalName, AppDisplayName
  | where FailureCount >= failureCountThreshold and SuccessCount >= successCountThreshold
  | mvexpand IPAddress
  | extend IPAddress = tostring(IPAddress)
  | extend timestamp = StartTimeUtc, AccountCustomEntity = UserPrincipalName, IPCustomEntity = IPAddress
entityMappings:
- entityType: Account
  fieldMappings:
  - identifier: FullName
    columnName: AccountCustomEntity
- entityType: IP
  fieldMappings:
  - identifier: Address
    columnName: IPCustomEntity
version: 1.0.0
kind: Scheduled
tags:
- Sentinel-As-Code
- Custom
- Microsoft Entra ID
