id: d45ad7f1-5db6-4a65-89b4-7141f0b45619
name: Azure AD Service Principal has failed authentication
description: |
  'Monitors AADServicePrincipalSignInLogs and identifies when a Service Principal has failed authentication.'
severity: Low
requiredDataConnectors:
- connectorId: AzureActiveDirectory
  dataTypes:
  - AADServicePrincipalSignInLogs
queryFrequency: PT1H
queryPeriod: PT1H
triggerOperator: gt
triggerThreshold: 0
enabled: true
tactics:
- CredentialAccess
- InitialAccess
relevantTechniques:
- T1078
- T1078.004
- T1528
- T1552
- T1552.001
query: |
  let Identities = _GetWatchlist('socManagedIdentities') | summarize ManagedIdentity = make_set(ServicePrincipalId);
  AADServicePrincipalSignInLogs
  | where ServicePrincipalName in (Identities)
  | where ResultType != 0
  | project-reorder TimeGenerated, ServicePrincipalName, ResourceDisplayName, ResultType, Location, IPAddress
entityMappings:
- entityType: Account
  fieldMappings:
  - identifier: Name
    columnName: ServicePrincipalName
- entityType: IP
  fieldMappings:
  - identifier: Address
    columnName: IPAddress
eventGroupingSettings:
  aggregationKind: SingleAlert
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: PT5H
    matchingMethod: AllEntities
    groupByEntities: []
    groupByAlertDetails: []
    groupByCustomDetails: []
version: 1.0.0
kind: Scheduled
tags:
- Sentinel-As-Code
- Custom
- Microsoft Entra ID
