id: c819e1b6-29b4-4693-a6ab-66038bcaeef9
name: Detect change to Conditional Access Policy
description: |
  'Detects any changes to Conditional Access Policies outside of business hours or on weekends'
severity: Medium
requiredDataConnectors:
- connectorId: YourConnectorId
  dataTypes:
  - YourDataType
queryFrequency: PT7H
queryPeriod: P7D
triggerOperator: gt
triggerThreshold: 0
enabled: true
tactics:
- DefenseEvasion
- CredentialAccess
- Persistence
relevantTechniques:
- T1556
- T1556.009
- T1562
- T1562.001
query: |
  AuditLogs
  | where OperationName has "conditional access"
  // extend LocalTime to your time zone
  | extend LocalTime=TimeGenerated + 1h
  // Change hours of the day to suit your company, i.e this would find activations between 6pm and 6am
  | extend DayOfWeek = case(
      startofday(LocalTime) == startofweek(LocalTime), "Sunday",
      startofday(LocalTime) == startofweek(LocalTime + 1d), "Monday",
      startofday(LocalTime) == startofweek(LocalTime + 2d), "Tuesday",
      startofday(LocalTime) == startofweek(LocalTime + 3d), "Wednesday",
      startofday(LocalTime) == startofweek(LocalTime + 4d), "Thursday",
      startofday(LocalTime) == startofweek(LocalTime + 5d), "Friday",
      startofday(LocalTime) == startofweek(LocalTime + 6d), "Saturday",
      "Unknown")
  | where DayOfWeek in ("Saturday", "Sunday") or datetime_part("Hour", LocalTime) < 6 or datetime_part("Hour", LocalTime) > 18
  | extend ['Conditional Access Policy Name'] = tostring(TargetResources[0].displayName)
  | extend Actor = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
  | project LocalTime,
      OperationName,
      ['Conditional Access Policy Name'],
      Actor
  | sort by LocalTime desc
entityMappings:
- entityType: Account
  fieldMappings:
  - identifier: Name
    columnName: Actor
eventGroupingSettings:
  aggregationKind: SingleAlert
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: true
    reopenClosedIncident: false
    lookbackDuration: P1D
    matchingMethod: Selected
    groupByEntities:
    - Account
    groupByAlertDetails: []
    groupByCustomDetails: []
version: 1.0.0
kind: Scheduled
tags:
- Sentinel-As-Code
- Custom
- Microsoft Entra ID
