id: 82007097-3881-43db-9801-ff8611c1e8c1
name: Owner added to high privileged application
description: |
  'An owner was added to application holding high privileged API permissions'
severity: Medium
requiredDataConnectors:
- connectorId: AzureActiveDirectory
  dataTypes:
  - AuditLogs
queryFrequency: PT30M
queryPeriod: PT30M
triggerOperator: gt
triggerThreshold: 0
enabled: true
tactics:
- Persistence
- PrivilegeEscalation
relevantTechniques:
- T1078
- T1078.004
- T1098
- T1098.001
query: |
  AuditLogs
  | where OperationName == "Add owner to application"
  | extend AppObjectId = tostring(TargetResources[1].id)
  | join kind=inner _GetWatchlist('HighRiskApps') on AppObjectId
  | extend TargetUser = tostring(TargetResources[0].userPrincipalName)
  | extend Actor = tostring(InitiatedBy.user.userPrincipalName)
entityMappings:
- entityType: Account
  fieldMappings:
  - identifier: FullName
    columnName: TargetUser
- entityType: Account
  fieldMappings:
  - identifier: FullName
    columnName: Actor
eventGroupingSettings:
  aggregationKind: AlertPerResult
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: PT5H
    matchingMethod: AllEntities
    groupByEntities: []
    groupByAlertDetails: []
    groupByCustomDetails: []
version: 1.0.0
kind: Scheduled
tags:
- Sentinel-As-Code
- Custom
- Microsoft Entra ID
