id: 2ca843a1-0dd7-41f9-a1ae-ca739c941d74
name: Password reset on high privileged user
description: |
  'The password of a user that is member of a high privileged role was reset.

  Make sure that this action was intended'
severity: Medium
requiredDataConnectors:
- connectorId: AzureActiveDirectory
  dataTypes:
  - AuditLogs
queryFrequency: PT3H
queryPeriod: PT3H
triggerOperator: gt
triggerThreshold: 0
enabled: true
tactics:
- Persistence
- PrivilegeEscalation
relevantTechniques:
- T1078
- T1078.004
- T1098
query: |
  let HighPrivRoles = dynamic(["Global Administrator", "Company Administrator", "Privileged Authentication Administrator", "Privileged Role Administrator"]);
  AuditLogs
  | where OperationName == "Reset user password"
  | mv-expand TargetResources
  | extend TargetUsername = tostring(TargetResources.userPrincipalName)
  | join kind=innerunique (
      IdentityInfo
      | where TimeGenerated > ago(14d)
      )
      on $left.TargetUsername == $right.AccountUPN
  | mv-expand AssignedRoles
  | extend AssignedRoles = tostring(AssignedRoles)
  | where AssignedRoles in (HighPrivRoles)
  | summarize by TimeGenerated, TargetUsername, AssignedRoles, OperationName, AADUserId=AccountObjectId
entityMappings:
- entityType: Account
  fieldMappings:
  - identifier: AadUserId
    columnName: AADUserId
- entityType: Account
  fieldMappings:
  - identifier: FullName
    columnName: TargetUsername
customDetails:
  AssignedRole: AssignedRoles
eventGroupingSettings:
  aggregationKind: AlertPerResult
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: PT5H
    matchingMethod: AllEntities
    groupByEntities: []
    groupByAlertDetails: []
    groupByCustomDetails: []
version: 1.0.0
kind: Scheduled
tags:
- Sentinel-As-Code
- Custom
- Microsoft Entra ID
