id: 93f64b3b-ac44-40fe-815e-6f05fb72dad8
name: High Privileged Role assigned
description: |
  'A user was assigned a high privileged role'
severity: Low
requiredDataConnectors:
- connectorId: AzureActiveDirectory
  dataTypes:
  - AuditLogs
queryFrequency: PT30M
queryPeriod: PT30M
triggerOperator: gt
triggerThreshold: 0
enabled: true
tactics:
- Persistence
- PrivilegeEscalation
relevantTechniques:
- T1078
- T1078.004
- T1098
- T1098.003
query: |
  let HighPrivRoles = dynamic(["Global Administrator","Company Administrator","Privileged Authentication Administrator","Privileged Role Administrator"]);
  AuditLogs
  | where OperationName == "Add member to role"
  | mv-expand TargetResources
  | mv-expand TargetResources.modifiedProperties
  | where TargetResources_modifiedProperties.name == "Role.name"
  | extend AddedToRole = replace_string(tostring(TargetResources_modifiedProperties.newValue),'"','')
  | where AddedToRole in~ (HighPrivRoles)
  | extend Actor = iff(isnotempty(InitiatedBy.user.userPrincipalName),InitiatedBy.user.userPrincipalName,InitiatedBy.app.servicePrincipalId)
  | extend TargetUsername = TargetResources.userPrincipalName
entityMappings:
- entityType: Account
  fieldMappings:
  - identifier: FullName
    columnName: Actor
- entityType: Account
  fieldMappings:
  - identifier: FullName
    columnName: TargetUsername
customDetails:
  AddedToRole: AddedToRole
eventGroupingSettings:
  aggregationKind: AlertPerResult
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: PT5H
    matchingMethod: AllEntities
    groupByEntities: []
    groupByAlertDetails: []
    groupByCustomDetails: []
version: 1.0.0
kind: Scheduled
tags:
- Sentinel-As-Code
- Custom
- Microsoft Entra ID
