id: c8fac852-f10c-4962-b0fb-11722e8c9bb8
name: Potential malicious sign-in from Azure AD Connect account
description: |
  'The Azure AD Connect account is accessing an ressource that it must not access. This is a high-fidelity sign of malicious actions.'
severity: High
queryFrequency: PT30M
queryPeriod: PT30M
triggerOperator: gt
triggerThreshold: 0
enabled: true
tactics:
- InitialAccess
- LateralMovement
- PrivilegeEscalation
relevantTechniques:
- T1078
- T1078.004
- T1550
- T1550.001
query: |
  union isfuzzy=true SigninLogs, AADNonInteractiveUserSignInLogs
  | where UserPrincipalName startswith "Sync_" and UserPrincipalName endswith "onmicrosoft.com"
  // Only alert when AppId != Microsoft Azure Active Directory Connect and the ressource is not AAD
  | where AppId != "cb1056e2-e479-49de-ae31-7812af012ed8" and ResourceDisplayName != "Windows Azure Active Directory"
entityMappings:
- entityType: CloudApplication
  fieldMappings:
  - columnName: AppId
    identifier: AppId
- entityType: CloudApplication
  fieldMappings:
  - columnName: AppDisplayName
    identifier: Name
- entityType: IP
  fieldMappings:
  - columnName: IPAddress
    identifier: Address
- entityType: Account
  fieldMappings:
  - columnName: UserPrincipalName
    identifier: FullName
- entityType: Account
  fieldMappings:
  - columnName: UserId
    identifier: AadUserId
eventGroupingSettings:
  aggregationKind: AlertPerResult
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    matchingMethod: Selected
    reopenClosedIncident: false
    groupByCustomDetails: []
    groupByEntities:
    - Account
    groupByAlertDetails: []
    lookbackDuration: PT1H
    enabled: true
version: 1.0.0
kind: Scheduled
tags:
- Sentinel-As-Code
- Custom
- Microsoft Entra ID
