id: 637fd019-d563-4292-92dd-3c4194e04ea8
name: Bumblebee stings with ransomware - Injected process performing domain exploration activity
description: |
  'https://security.microsoft.com/threatanalytics3/048e866a-0a92-47b8-94ac-c47fe577cc33/analystreport

  Look for processes injected by Cobalt Strike or Meterpreter named "wab.exe", "wabmig.exe", or "ImagingDevices.exe" that performs domain exploration and reconnaissance activity. Other campaigns will inject into these processes as well, so activity surfaced will be malicious and require investigation, it may not be specific to Bumblebee.'
severity: High
requiredDataConnectors:
- connectorId: MicrosoftDefenderforEndpoints
  dataTypes:
  - DeviceProcessEvents
queryFrequency: PT1H
queryPeriod: PT1H
triggerOperator: gt
triggerThreshold: 0
enabled: true
tactics:
- Execution
- Persistence
- DefenseEvasion
- LateralMovement
relevantTechniques:
- T1055
- T1059
- T1059.003
- T1211
- T1554
- T1569
- T1569.002
query: |
  DeviceProcessEvents
  | where InitiatingProcessFileName has_any ('wab.exe','wabmig.exe','ImagingDevices.exe') and ProcessCommandLine has 'cmd.exe'
entityMappings:
- entityType: Process
  fieldMappings:
  - identifier: CommandLine
    columnName: ProcessCommandLine
- entityType: Process
  fieldMappings:
  - identifier: CommandLine
    columnName: InitiatingProcessFileName
eventGroupingSettings:
  aggregationKind: SingleAlert
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: PT5H
    matchingMethod: AllEntities
    groupByEntities: []
    groupByAlertDetails: []
    groupByCustomDetails: []
version: 1.0.0
kind: Scheduled
tags:
- Sentinel-As-Code
- Custom
- Microsoft Defender XDR
