id: 2e99f0c6-8b52-46a0-9ea4-eb84d11a2b2a
name: Bumblebee stings with ransomware - Malicious export functions in Bumblebee DLL
description: |
  'https://security.microsoft.com/threatanalytics3/048e866a-0a92-47b8-94ac-c47fe577cc33/analystreport

  Look for command line which contains malicious export functions as listed in query – this is a list of observed exports at time of writing and may change over time.'
severity: High
requiredDataConnectors:
- connectorId: MicrosoftDefenderforEndpoints
  dataTypes:
  - DeviceFileEvents
  - DeviceProcessEvents
queryFrequency: PT1H
queryPeriod: PT1H
triggerOperator: gt
triggerThreshold: 0
enabled: true
tactics:
- Execution
- Persistence
- DefenseEvasion
- LateralMovement
relevantTechniques:
- T1059
- T1059.003
- T1211
- T1554
- T1569
- T1569.002
- T1574
- T1574.002
query: |
  union DeviceFileEvents, DeviceProcessEvents
  | where ProcessCommandLine has_any ("juwXYebIfE", "LeKGTMwkFQ", "dSjXqiVvQK", "SjVjlixjPb", "MDbJvVaNCR", "EPTsswwiRJ", "IternalJob", "YTBSBbNTWU", "AUjoZKdcSZ", "xshiMECwuG", "rBgTBiTTDW", "EUQtIMIQqE", "shjKeAQfgT", "zYKGjAgZov", "pGUAYVFxbN", "VcrbRMwpuk", "ZmJwfQQnqA", "zYKGjAgZov", "kXlNkCKgFC")
entityMappings:
- entityType: Process
  fieldMappings:
  - identifier: CommandLine
    columnName: ProcessCommandLine
eventGroupingSettings:
  aggregationKind: SingleAlert
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: PT5H
    matchingMethod: AllEntities
    groupByEntities: []
    groupByAlertDetails: []
    groupByCustomDetails: []
version: 1.0.0
kind: Scheduled
tags:
- Sentinel-As-Code
- Custom
- Microsoft Defender XDR
