id: 033c9213-ebef-426d-b228-feafe932cae0
name: CVE-2022-41040 & CVE-2022-41082 - Suspicious files in Exchange directories
description: |
  'Identifies potential ProxyNotShell attacks where suspicious files have been created by the Internet Information Service process on a Microsoft Exchange server.
  https://security.microsoft.com/threatanalytics3/3269c2bd-ad05-47c9-ac09-cc2aa87475e6/analystreport'
severity: High
requiredDataConnectors:
- connectorId: MicrosoftDefenderforEndpoints
  dataTypes:
  - DeviceFileEvents
queryFrequency: PT1H
queryPeriod: PT1H
triggerOperator: gt
triggerThreshold: 0
enabled: true
tactics:
- Execution
- InitialAccess
- Persistence
relevantTechniques:
- T1078
- T1078.004
- T1190
- T1203
- T1543
- T1543.003
- T1574
- T1574.001
- T1574.002
query: |
  DeviceFileEvents
  | where TimeGenerated >= ago(7d)
  | where InitiatingProcessFileName == "w3wp.exe"
  | where FolderPath has @"FrontEnd\HttpProxy\"
  | where InitiatingProcessCommandLine contains "MSExchange"
  | project FileName, FolderPath, SHA256, InitiatingProcessCommandLine, DeviceId, TimeGenerated
entityMappings:
- entityType: File
  fieldMappings:
  - identifier: Name
    columnName: FileName
- entityType: Process
  fieldMappings:
  - identifier: CommandLine
    columnName: InitiatingProcessCommandLine
eventGroupingSettings:
  aggregationKind: SingleAlert
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: PT5H
    matchingMethod: AllEntities
    groupByEntities: []
    groupByAlertDetails: []
    groupByCustomDetails: []
version: 1.0.0
kind: Scheduled
tags:
- Sentinel-As-Code
- Custom
- Microsoft Defender XDR
