id: d3997945-0ac4-4917-afa1-b40c4a4f9f5c
name: Non Domain Controller Active Directory Replication
description: |
  'This query detects potential attempts by non-computer accounts (non domain controllers) to retrieve/synchronize an active directory object leveraging directory replication services (DRS).'
severity: High
requiredDataConnectors:
- connectorId: SecurityEvent
  dataTypes:
  - SecurityEvent
queryFrequency: P1D
queryPeriod: P7D
triggerOperator: gt
triggerThreshold: 0
enabled: true
tactics:
- CredentialAccess
relevantTechniques:
- T1003
- T1003.006
query: |
  let KnownDCList = _GetWatchlist('knownDCAccounts') | project ComputerAccount;
  //The above is querying the 'KnownDCAccounts' Watchlist to check for Domain Controllers we would expect to see in a Client workspace.
  SecurityEvent
  | where Computer in (KnownDCList)
  | where EventID == 4662 and ObjectServer == 'DS'
  | where AccountType != 'Machine'
  | where Properties has '1131f6aa-9c07-11d1-f79f-00c04fc2dcd2' //DS-Replication-Get-Changes
    or Properties has '1131f6ad-9c07-11d1-f79f-00c04fc2dcd2' //DS-Replication-Get-Changes-All
    or Properties has '89e95b76-444d-4c62-991a-0facbeda640c' //DS-Replication-Get-Changes-In-Filtered-Set
  | project TimeGenerated, Account, Activity, Properties, SubjectLogonId, Computer
  | join kind=inner
  (
    SecurityEvent
    | where Computer in (KnownDCList)
    | where EventID == 4624 and LogonType == 3
    | where AccountType != 'Machine'
    | project TargetLogonId, IpAddress
  )
  on $left.SubjectLogonId == $right.TargetLogonId
  | project-reorder TimeGenerated, Computer, Account, IpAddress
  | extend timestamp = TimeGenerated, AccountCustomEntity = Account, HostCustomEntity = Computer, SourceAddress = IpAddress
entityMappings:
- entityType: Account
  fieldMappings:
  - identifier: FullName
    columnName: AccountCustomEntity
- entityType: Host
  fieldMappings:
  - identifier: FullName
    columnName: HostCustomEntity
- entityType: IP
  fieldMappings:
  - identifier: Address
    columnName: SourceAddress
version: 1.0.0
kind: Scheduled
tags:
- Sentinel-As-Code
- Custom
- Windows Security Events
